# Переменные , функция input() , типы данных

# in_1 = input("Введите число А: ")
# in_2 = input("Введите число B: ")

# result = int(in_1) + int(in_2)

# print("Результат: ", result)

# Типы данных

# Целочисленный тип данных
int_num = 777

#  тип данных число с плавающей точкой (пишутся через точку)
float_num = 3.14

# строка (строковой тип данных)
string = "Hello, world!"

# булевы типы данных
boolean_t = True 
boolean_f = False

# способ форматирования строк f-строка (f-string)

# name = input("Введите имя: ")
# age = input("Введите возраст: ")

# s = f"имя: {name} возраст: {age}"

# print(s)

# Арифметические операции

x = 5

y = 7

# сложение
res = x + y

# Вычитание
res = x - y 

# умножение
res = x * y

# обычное деление
res = x / y

# целочисленное деление
res = x // y

# деление по остатку
x = 3
y = 2
res = x % y

# возведение в степень
res = x ** y

# Логические операции
x = 5
y = 3

#  операция не равно
res = x != y

# операция равно
res = x == y
print(res)